from лексер import лексер
from парсер import Парсер
from інтерпретатор import Інтерпретатор
from структури import ВикликФункції

def завантажити_код(шлях):
    with open(шлях, 'r', encoding='utf-8') as файл:
        return файл.read()

if __name__ == '__main__':
    код = завантажити_код('приклади/тест.ukr')
    токени = list(лексер(код))
    парсер = Парсер(токени)
    програма = []

    while парсер.поточний < len(токени):
        поточний_токен = парсер.поточний_токен()
        if поточний_токен[0] == 'ФУНКЦІЯ':
            програма.append(парсер.розпарсити_функцію())
        else:
            програма.append(парсер.розпарсити_команду())


    # Шукаємо функцію з ім'ям 'головна' і викликаємо її
    інтерпретатор = Інтерпретатор()
    інтерпретатор.виконати(програма)
    інтерпретатор.виконати([
        ВикликФункції('головна', [])
    ])

