class Функція:
    def __init__(self, імʼя, параметри, тіло):
        self.імʼя = імʼя
        self.параметри = параметри
        self.тіло = тіло

class ВикликФункції:
    def __init__(self, імʼя, аргументи):
        self.імʼя = імʼя
        self.аргументи = аргументи

class Повернути:
    def __init__(self, значення):
        self.значення = значення

class Друк:
    def __init__(self, аргументи):
        self.аргументи = аргументи

class Якщо:
    def __init__(self, умова, тіло, інакше_тіло=None):
        self.умова = умова
        self.тіло = тіло
        self.інакше_тіло = інакше_тіло

class Присвоєння:
    def __init__(self, імʼя, значення):
        self.імʼя = імʼя
        self.значення = значення

class Поки:
    def __init__(self, умова, тіло):
        self.умова = умова
        self.тіло = тіло

class УнарнаОперація:
    def __init__(self, оператор, операнд):
        self.оператор = оператор
        self.операнд = операнд
